import React, { useState } from "react";
import {
  TextField,
  MenuItem,
  Select,
  InputLabel,
  FormControl,
  Button,
  Grid,
} from "@mui/material";
import Typography from "@mui/material/Typography";
import Snackbar from "@mui/material/Snackbar";
import Card from "@mui/material/Card";
import Box from "@mui/material/Box";
import Stack from "@mui/material/Stack";
import Backdrop from "@mui/material/Backdrop";
import CircularProgress from "@mui/material/CircularProgress";
import Divider from "@mui/material/Divider";
import { colors } from "@mui/material";

function SVRContent() {
  const [rainfall, setRainfall] = useState("");
  const [temperature, setTemperature] = useState("");
  const [roadEncoded, setRoadEncoded] = useState("");
  const [date, setDate] = useState("");
  const [Total_Vol_Calculated, setTotal_Vol_Calculated] = useState("");
  const [Total_Vol_Lag1, setTotal_Vol_Lag1] = useState("");
  const [Total_Vol_Lag7, setTotal_Vol_Lag7] = useState("");
  const [openSnackbar, setOpenSnackbar] = useState(false);
  const [predictionResult, setPredictionResult] = useState([]);

  const handleClose = () => {
    setOpenSnackbar(false);
  };

  const Code = [
    {
      รหัสถนน: {
        กรุงเกษม: 1,
        หลานหลวง: 319,
        ศรีบูรพา: 246,
        อาคารสงเคราะห์: 324,
        "เพชรเกษม 81": 370,
        เลียบคลองภาษีเจริญฝั่งเหนือ: 380,
        เลียบคลองภาษีเจริญฝั่งเหนือ1: 380,
        เกษมราษฎร์: 340,
        "พระรามที่ 4": 154,
        "กำแพงเพชร 6": 15,
        งามวงศ์วาน: 24,
        "อ่อนนุช 46": 337,
        อ่อนนุช: 335,
        "สุขาภิบาล 5": 285,
        จตุโชติ: 26,
        "สุขาภิบาล 5__1": 285,
        เพิ่มสิน: 374,
        คุ้มเกล้า: 19,
        ฉลองกรุง: 36,
        "ฉลองกรุง 31": 37,
        ส่วนบุคคล: 308,
        ประชาอุทิศ: 134,
        หมู่บ้านสินทวี: 317,
        "ประชาอุทิศ (SB)": 135,
        พุทธบูชา: 170,
        "ประชาอุทิศ (WB)": 136,
        "สายไหม 39": 275,
        สายไหม: 274,
        "บางบอน 3": 112,
        "บางบอน 3 ซอย 5": 114,
        "บางบอน 3 ซอย 10": 113,
        "กำแพงเพชร 6__1": 15,
        ชิดชน: 42,
        ทองหล่อ: 73,
        "ทองหล่อ 11": 75,
        "ทองหล่อ 10": 74,
        "ยุคล 2": 187,
        บำรุงเมือง: 119,
        พลับพลาไชย: 160,
        บำรุงเมือง__1: 119,
        วิทยุ: 237,
        เพลินจิต: 373,
        วิทยุ__1: 237,
        รัชดาภิเษก: 188,
        ประชาราษฎร์บำเพ็ญ: 126,
        เชื่อมสัมพันธ์: 356,
        บุรีภิรมย์: 120,
        รางโพธิ์: 193,
        พรหมราษฎร์: 145,
        พรมแดน: 144,
        "ทางเข้าออกแฟลต ทบ.ส่วนกลางบางเขน": 90,
        ผลาสินธุ์: 142,
        เจริญนคร: 348,
        สมเด็จเจ้าพระยา: 254,
        ลาดหญ้า: 231,
        นวลจันทร์: 100,
        คลองลำเจียก: 18,
        "อ่อนนุช 17": 336,
        ศรีนครินทร์: 244,
        ทางเข้าตลาดเทิดไท: 82,
        ขุมทองลำต้อยติ่ง: 17,
        หลวงแพ่ง: 318,
        จรัญสนิทวงศ์: 27,
        บางขุนนนท์: 109,
        "จรัญสนิทวงศ์ 32": 30,
        "กำแพงเพชร 2": 13,
        "กำแพงเพชร 6__2": 15,
        กาญจนาภิเษก: 7,
        "เพชรเกษม 86": 372,
        เพชรเกษม: 364,
        ตรีเพชร: 56,
        ตีทอง: 58,
        เจริญกรุง: 346,
        อัษฎางค์: 323,
        บำรุงเมือง__2: 119,
        "กำแพงเพชร 6__3": 15,
        แจ้งวัฒนะ: 397,
        "วัชรพล (SB)": 236,
        "วัชรพล (EB)": 235,
        "รามอินทรา 65": 213,
        หทัยราษฎร์: 311,
        ไทยรามัญ: 402,
        หทัยราษฎร์__1: 311,
        "หทัยราษฎร์  22": 312,
        ประชาธิปไตย: 124,
        นครราชสีมา: 93,
        กรุงเกษม__1: 1,
        เลียบวารี: 384,
        เลียบวารี__1: 384,
        เลียบวารี__2: 384,
        เลียบวารี__3: 384,
        ราษฎร์อุทิศ: 215,
        เลียบคลองพิทยาลงกรณ์: 379,
        บางขุนเทียนชายทะเล: 111,
        เลียบคลองพิทยาลงกรณ์__1: 379,
        ทางเข้าออกขนส่งเอกมัย: 85,
        เอกมัย: 395,
        สุขุมวิท: 286,
        "สุขุมวิท 42": 292,
        สุขุมวิท__1: 286,
        บางแค: 117,
        เพชรเกษม__1: 364,
        ตีทอง__1: 58,
        ราชบพิธ: 199,
        "พระรามที่ 6": 156,
        "เคหะร่มเกล้า 33": 345,
        "เคหะร่มเกล้า (SB)": 343,
        "เคหะร่มเกล้า (EB)": 342,
        "เคหะร่มเกล้า 31": 344,
        พหลโยธิน: 161,
        "พหลโยธิน 48": 163,
        "กำแพงเพชร 6__4": 15,
        เชิดวุฒากาศ: 355,
        ลาดพร้าววังหิน: 229,
        ลาดปลาเค้า: 220,
        "เสนานิคม 1": 388,
        ตะนาว: 57,
        มหรรณพ: 175,
        "กรุงเทพกรีฑา 20": 5,
        "กรุงเทพกรีฑา 37": 6,
        กรุงเทพกรีฑา: 4,
        "คู่ขนานกาญจนาภิเษก(มอเตอร์เวย์ 9)": 21,
        "กาญจนาภิเษก 5/1": 8,
        "กาญจนาภิเษก 6": 9,
        "คู่ขนานกาญจนาภิเษก(มอเตอร์เวย์ 9)__1": 21,
        ตีทอง__2: 58,
        ตีทอง__3: 58,
        ดินสอ: 53,
        บำรุงเมือง__3: 119,
        มหาไชย: 178,
        บำรุงเมือง__4: 119,
        สำราญราษฎร์: 277,
        "กำแพงเพชร 6__5": 15,
        ทางข้ามทางรถไฟสายเหนือ: 77,
        ดินสอ__1: 53,
        ศิริพงษ์: 249,
        อุณากรรณ: 330,
        เชื่อมสัมพันธ์__1: 356,
        สกุลดี: 251,
        "ประชาร่วมใจ 31": 132,
        ประชาร่วมใจ: 131,
        "บางบอน 5": 115,
        "บางบอน 5 ซอย 5": 116,
        เฟื่องนคร: 375,
        ตะนาว__1: 57,
        บำรุงเมือง__5: 119,
        ราชบพิธ__1: 199,
        ดินสอ__2: 53,
        "เฉลิมพระเกียรติ ร.9": 354,
        อ่อนนุช__1: 335,
        เจริญพัฒนา: 349,
        "สุเหร่าคลองหนึ่ง ซ.15": 306,
        สุเหร่าคลองหนึ่ง: 305,
        "หนองแขม - วัดศรีนวล": 314,
        "สวัสดิการ 1": 259,
        "หนองแขม-วัดศรีนวล": 315,
        เลียบคลองภาษีเจริญฝั่งใต้: 381,
        เลียบคลองภาษีเจริญฝั่งใต้__1: 381,
        "กำแพงเพชร 6__6": 15,
        "วิภาวดีรังสิต 25": 240,
        "สุขาภิบาล  5": 283,
        เทพรักษ์: 357,
        เทพรักษ์__1: 357,
        เทพรักษ์__2: 357,
        "มิตรไมตรี 3": 183,
        "มิตรไมตรี 4": 184,
        มิตรไมตรี: 181,
        เจริญนคร__1: 348,
        เจริญนคร__2: 348,
        กรุงธนบุรี: 0,
        นิมิตรใหม่: 103,
        หทัยมิตร: 310,
        นิมิตรใหม่__1: 103,
        ประชาชื่น: 121,
        งามวงศ์วาน__1: 24,
        ศรีนครินทร์__1: 244,
        รามคำแหง: 207,
        ท่าดินแดง: 91,
        อิสรภาพ: 328,
        ฉลองกรุง__1: 36,
        "ฉลองกรุง 31__1": 37,
        ซอยส่วนบุคคล: 50,
        "อ่อนนุช 59": 338,
        อ่อนนุช__2: 335,
        "อ่อนนุช 74/3": 339,
        อ่อนนุช__3: 335,
        นครสวรรค์: 94,
        กรุงเกษม__2: 1,
        ศรีนครินทร์__2: 244,
        พัฒนาการ: 164,
        นราธิวาสราชนครินทร์: 96,
        สีลม: 279,
        อรุณอมรินทร์: 320,
        พรานนก: 158,
        "ซอยสว่าง 1- ทางด่วน- ซอยพระยาดำรง": 48,
        บรรทัดทอง: 106,
        "พระรามที่ 4__1": 154,
        "ประชาราษฎร์สาย 1": 129,
        "ประชาราษฎร์สาย 2": 130,
        มักกะสัน: 179,
        เพชรบุรี: 362,
        เจริญราษฎร์: 350,
        จันทน์: 34,
        "ณ ระนอง": 51,
        "พระรามที่ 3": 153,
        สุนทรโกษา: 301,
        รัชดาภิเษก__1: 188,
        คู่ขนานกาญจนาภิเษก: 20,
        หนองระแหง: 313,
        หนองระแหง__1: 313,
        หทัยราษฎร์__2: 311,
        สุขุมวิท__2: 286,
        "สุขุมวิท 103": 288,
        "สุขุมวิท 101/1": 287,
        ศรีนครินทร์__3: 244,
        "พัฒนาการ 53": 166,
        พัฒนาการ__1: 164,
        ศรีนครินทร์__4: 244,
        อ่อนนุช__4: 335,
        พระนเรศวรมหาราช: 146,
        ถนนสนามไชย: 66,
        ถนนราชดำเนินใน: 63,
        ถนนหน้าพระลาน: 68,
        ถนนหลักเมือง: 69,
        "ราชมนตรี 8": 202,
        "เพชรเกษม 48": 367,
        บางแวก: 118,
        "เสนานิคม 1__1": 388,
        ลาดพร้าววังหิน__1: 228,
        "ลาดพร้าววังหิน 79": 230,
        "โชคชัย 4": 401,
        "ถนนกรุงเทพกรีฑา (NB)": 60,
        "ซอยกรุงเทพกรีฑา 7": 44,
        "ถนนกรุงเทพกรีฑา (EB)": 59,
        "ถนนศรีนครินทร์-ร่มเกล้า": 65,
        "กรุงเทพกรีฑา 20__1": 5,
        "กรุงเทพกรีฑา 37__1": 6,
        กรุงเทพกรีฑา__1: 4,
        เสรีไทย: 390,
        ทางเข้าหมู่บ้านสหกรณ์: 84,
        เสรีไทย__1: 390,
        มหาดไทย: 176,
        ลาดพร้าว: 221,
        "รามคำแหง 65": 209,
        รามคำแหง__1: 207,
        ศูนย์วิจัย: 250,
        เพชรบุรี__1: 362,
        เลียบใต้ทางด่วนศรีรัช: 385,
        ถนนสุรวงศ์: 67,
        เจริญกรุง__1: 346,
        สุรวงศ์: 302,
        สาธุประดิษฐ์: 272,
        รัชดาภิเษก__2: 188,
        สุนทรโกษา__1: 301,
        "พระรามที่ 4__2": 154,
        ถนนราชดำเนินนอก: 62,
        ถนนวิสุทธิกษัตริย์: 64,
        ถนนจักรพรรดิพงษ์: 61,
        "พระรามที่ 5": 155,
        ราชวิถี: 204,
        รัชดาภิเษก__3: 188,
        สุทธิสารวินิจฉัย: 300,
        "พระรามที่ 5__1": 155,
        สุโขทัย: 307,
        สุรวงศ์__1: 302,
        อังรีดูนังต์: 322,
        "พระรามที่ 4__3": 154,
        เจริญกรุง__2: 346,
        "เจริญกรุง 42": 347,
        สีลม__1: 279,
        "พระรามที่ 5__2": 155,
        อำนวยสงคราม: 326,
        เศรษฐศิริ: 386,
        นครราชสีมา__1: 93,
        ราชวิถี__1: 204,
        เจริญราษฎร์__1: 350,
        "พระรามที่ 3__1": 153,
        พหลโยธิน__1: 161,
        กำแพงเพชร: 12,
        "พหลโยธิน 18": 162,
        ประชาสงเคราะห์: 133,
        ดินแดง: 54,
        อโศกดินแดง: 333,
        "เอราวัณ ปาร์ค อเวนิว": 396,
        เลียบทางรถไฟสายใต้: 383,
        "เอกชัย 36": 392,
        เอกชัย: 391,
        "เอกชัย 36__1": 392,
        "เอกชัย 69/1": 393,
        เอกชัย__1: 391,
        "เอกชัย 89/9": 394,
        เอกชัย__2: 391,
        "พระรามที่ 2 ซอย 20": 151,
        "พระรามที่ 2": 149,
        "พระรามที่ 2 ซอย 28": 152,
        "พระรามที่ 2__1": 150,
        นวมินทร์: 97,
        แฮปปี้แลนด์: 400,
        ศรีนครินทร์__5: 244,
        "ศรีนครินทร์ 38": 245,
        "อ่อนนุช 46__1": 337,
        "ศรีนครินทร์ 38__1": 245,
        จรัญสนิทวงศ์__1: 27,
        จรัญสนิทวงศ์__2: 27,
        "จรัญสนิทวงศ์ 13": 29,
        "ลาดพร้าว 58": 225,
        "ลาดพร้าว 53/1": 224,
        ลาดพร้าว__1: 221,
        "สุขุมวิท 32": 290,
        "สุขุมวิท 49": 294,
        สุขุมวิท__3: 286,
        ศรีบูรพา__1: 246,
        เสรีไทย__2: 390,
        เจริญกรุง__3: 346,
        "พระรามที่ 3__2": 153,
        กาญจนาภิเษก__1: 7,
        เอกชัย__3: 391,
        รัชดาภิเษก__4: 188,
        ประชาสงเคราะห์__1: 133,
        ประชาราษฎร์บำเพ็ญ__1: 126,
        ประชาอุทิศ__1: 134,
        "ประชาราษฎร์บำเพ็ญ (SB)": 128,
        "ประชาราษฎร์บำเพ็ญ (EB)": 127,
        "เพชรเกษม 81__1": 370,
        เลียบคลองภาษีเจริญฝั่งใต้__2: 381,
        "เพชรเกษม 81__2": 370,
        เลียบคลองภาษีเจริญฝั่งเหนือ__2: 380,
        พหลโยธิน__2: 161,
        ธูปเตมีย์: 92,
        จันทรุเบกษา: 35,
        พหลโยธิน__3: 161,
        ทางเข้าออกอากาศโยธิน: 87,
        "ช่องทางท่าดินแดง 5": 43,
        มัยลาภ: 180,
        "ประเสริฐมนูกิจ 29": 140,
        ประเสริฐมนูกิจ: 139,
        ประชาชื่น__1: 121,
        ประชาชื่น__2: 121,
        เทศบาลสงเคราะห์: 358,
        ประชาชื่น__3: 121,
        ประชาชื่น__4: 121,
        ประชาชื่น__5: 121,
        บริพัตร: 107,
        ราชดำเนินกลาง: 196,
        ปรินายก: 141,
        ราชดำเนินนอก: 197,
        นครสวรรค์__1: 94,
        หลานหลวง__1: 319,
        ประชาชื่น__6: 121,
        วงศ์สว่าง: 232,
        พิบูลสงคราม: 168,
        ลาซาล: 217,
        ลาซาล__1: 217,
        แบริ่งลาซาล: 398,
        "ประชาราษฎร์สาย 1__1": 129,
        "ประชาราษฎร์สาย 2__1": 130,
        "ประชาราษฎร์สาย 2__2": 130,
        กำนันแม้น: 10,
        "กำนันแม้น 8": 11,
        "ประชาราษฎร์สาย 2__3": 130,
        "ประชาราษฎร์สาย 2__4": 130,
        "กรุงเทพ - นนทบุรี": 3,
        "กรุงเทพ - นนทบุรี__1": 2,
        จันทน์__1: 34,
        สาธุประดิษฐ์__1: 272,
        นราธิวาสราชนครินทร์__1: 96,
        ประชาธิปไตย__1: 124,
        วิสุทธิกษัตริย์: 241,
        "พระรามที่ 6__1": 156,
        "กำแพงเพชร 5": 14,
        กำแพงเพชร__1: 12,
        ประดิษฐ์มนูธรรม: 138,
        ประดิษฐ์มนูธรรม__1: 138,
        ศรีนครินทร์__6: 244,
        ศรีนครินทร์__7: 244,
        ลาดพร้าว__2: 221,
        จรัญสนิทวงศ์__3: 27,
        บรมราชชนนี: 105,
        เลียบคลองสอง: 382,
        เลียบคลองสอง__1: 382,
        จรัญสนิทวงศ์__4: 27,
        เลียบวารี__4: 384,
        เลียบวารี__5: 384,
        เลียบวารี__6: 384,
        จรัญสนิทวงศ์__5: 27,
        "พรานนก - กาญจนาภิเษก": 159,
        พรานนก__1: 158,
        ชัยพฤกษ์: 40,
        ชักพระ: 39,
        ฉิมพลี: 38,
        เลียบทางรถไฟสายใต้__1: 383,
        อิสรภาพ__1: 328,
        วังเดิม: 234,
        อรุณอมรินทร์__1: 320,
        วังเดิม__1: 234,
        ชัยพฤกษ์__1: 40,
        สวนผัก: 257,
        "ชัยพฤกษ์ 18": 41,
        "เพชรเกษม 69": 369,
        "เพชรเกษม 102/4": 365,
        เพขรเกษม: 361,
        "สุขุมวิท 42__1": 292,
        สุขุมวิท__4: 286,
        นิมิตใหม่: 104,
        หทัยราษฎร์__3: 311,
        สุวินทวงศ์: 303,
        พหลโยธิน__4: 161,
        เลียบคลองบางเขน: 378,
        "เสนานิคม 1 ซอย 8": 389,
        "เสนานิคม 1__2": 388,
        "พระรามที่ 6__2": 156,
        เพชรบุรี__2: 362,
        "ลาดพร้าว 15": 223,
        ลาดพร้าว__3: 222,
        "ลาซาล 55": 219,
        "ลาซาล 46": 218,
        "ลาซาล 55__1": 219,
        ลาซาล__2: 217,
        "เพชรเกษม 55": 368,
        "พุทธมณฑลสาย 2": 172,
        เพชรเกษม__2: 364,
        "พุทธมณฑลสาย 2__1": 172,
        "รัชมงคลประสาธน์ 10": 191,
        รัชมงคลประสาธน์: 190,
        รัชมงคลประสาธน์__1: 189,
        เทอดไท: 360,
        พิษณุโลก: 169,
        นครสวรรค์__2: 94,
        ทางเข้าออกตลาดวงศกร: 86,
        เฉลิมพงษ์: 353,
        สายไหม__1: 274,
        ราชดำเนินใน: 198,
        สมเด็จพระปิ่นเกล้า: 252,
        ราชดำเนินกลาง__1: 196,
        จักรพงษ์: 32,
        นครสวรรค์__3: 94,
        จักรพรรดิพงษ์: 33,
        เจษฎา: 351,
        กำแพงเพชร__2: 12,
        ทรงสวัสดิ์: 71,
        เยาวราช: 376,
        แปลงนาม: 399,
        พลับพลาไชย__1: 160,
        เจริญกรุง__4: 346,
        อิสรภาพ__2: 328,
        พานนก: 167,
        "พุทธมณฑลสาย 1": 171,
        เพชรเกษม__3: 364,
        ศรีนคริน: 243,
        อุดมสุข: 331,
        "ซอยรามคำแหง 60": 47,
        พ่วงศิริ: 174,
        รามคำแหง__2: 207,
        ทางรถไฟสายปากน้ำ: 78,
        สรรพาวุธ: 255,
        มหาพฤฒาราม: 177,
        "พระรามที่ 4__4": 154,
        "เฉลิมพระเกียรติ ร.9__1": 354,
        อ่อนนุช__5: 335,
        หมู่บ้านนักกีฬาแหลมทอง: 316,
        กรุงเทพกรีฑา__2: 4,
        ราชวงศ์: 203,
        เยาวราช__1: 376,
        วรจักร: 233,
        เจริญกรุง__5: 346,
        มหาไชย__1: 178,
        เจริญกรุง__6: 346,
        ประชาธิปก: 123,
        อิสรภาพ__3: 328,
        ท่าดินแดง__1: 91,
        สมเด็จเจ้าพระยา__1: 254,
        เจริญนคร__3: 348,
        สมเด็จเจ้าพระยา__2: 254,
        ลาดหญ้า__1: 231,
        ประชาร่วมใจ__1: 131,
        นิมิตรใหม่__2: 102,
        สุวินทวงศ์__1: 303,
        สะพานพระพุทธยอดฟ้า: 263,
        สะพานพระปกเกล้า: 262,
        สะพานสมเด็จพระเจ้าตากสิน: 269,
        สะพานกรุงธน: 260,
        "สะพานพระราม 8": 266,
        สะพานสมเด็จพระปิ่นเกล้า: 268,
        สะพานกรุงเทพ: 261,
        "สะพานพระราม 3": 264,
        "สะพานภูมิพล 1": 267,
        รัชดาภิเษก__5: 188,
        "งามวงศ์วาน-ประเสริฐมนูกิจ": 25,
        รัชดาภิเษก__6: 188,
        "สะพานพระราม 7": 265,
        ราชปรารภ: 200,
        "ราชวิถี 2": 205,
        ราชวิถี__2: 204,
        ดินแดง__1: 54,
        ดินแดง__2: 54,
        พหลโยธิน__5: 161,
        แจ้งวัฒนะ__1: 397,
        รามอินทรา: 210,
        วิภาวดีรังสิต: 239,
        พหลโยธิน__6: 161,
        สุขุมวิท__5: 286,
        "สุขุมวิท 55": 295,
        ทองหล่อ__1: 73,
        เพชรบุรี__3: 362,
        ลาดปลาเค้า__1: 220,
        รามอินทรา__1: 210,
        รัชดาภิเษก__7: 188,
        อโศกมนตรี: 334,
        สุขุมวิท__6: 286,
        สุขุมวิท__7: 286,
        "สุขุมวิท 48/3": 293,
        "สุขุมวิท 77": 298,
        นางลิ้นจี่: 101,
        รัชดาภิเษก__8: 188,
        จรัญสนิทวงศ์__6: 27,
        "จรัญสนิทวงศ์ 1": 28,
        "เพชรเกษม 16": 366,
        เพชรเกษม__4: 364,
        "สุขุมวิท 39": 291,
        สุขุมวิท__8: 286,
        "ซอยสุขุมวิท 22": 49,
        สุขุมวิท__9: 286,
        อิสรภาพ__4: 328,
        อิสรภาพ__5: 328,
        "อิสรภาพ 44": 329,
        เจริญนคร__4: 348,
        เจริญนคร__5: 348,
        กรุงธนบุรี__1: 0,
        บางขุนเทียน: 110,
        สะแกงาม: 270,
        เจริญกรุง__7: 346,
        ทางเข้าคอนโดฯ: 81,
        จันทน์__2: 34,
        บริพัตร__1: 107,
        ราชดำเนินกลาง__2: 196,
        ปรินายก__1: 141,
        ราชดำเนินนอก__1: 197,
        นครสวรรค์__4: 94,
        หลานหลวง__2: 319,
        เลียบวารี__7: 384,
        คู้คลองสิบ: 22,
        มิตรไมตรี__1: 181,
        "มิตรไมตรี 12/2": 182,
        มิตรไมตรี__2: 181,
        "มิตรไมตรี 3__1": 183,
        "มิตรไมตรี 4__1": 184,
        มิตรไมตรี__3: 181,
        "พระรามที่ 6__3": 156,
        ศรีอยุธยา: 247,
        กิ่งแก้ว: 16,
        อ่อนนุช__6: 335,
        ราชดำริ: 194,
        สารสิน: 276,
        เจริญนคร__6: 348,
        มไหสวรรย์: 186,
        พญาไท: 143,
        พหลโยธิน__7: 161,
        ราชวิถี__3: 204,
        "สุขาภิบาล 1": 284,
        ลาดปลาเค้า__2: 220,
        เสนานิคม: 387,
        "วิทยุ - ทางขึ้นลงทางด่วน": 238,
        "เพชรบุรี 37-ทางลงทางด่วน": 363,
        เพชรบุรี__4: 362,
        ประชาธิปไตย__2: 124,
        วิสุทธิกษัตริย์__1: 241,
        อรุณอัมรินทร์: 321,
        สมเด็จพระปิ่นเกล้า__1: 252,
        พญาไท__1: 143,
        ศรีอยุธยา__1: 247,
        สุขุมวิท__10: 286,
        "สุขุมวิท 101/1__1": 287,
        ฉลองกรุง__2: 36,
        เจ้าคุณทหาร: 352,
        ฉลองกรุง__3: 36,
        รัชดาภิเษก__9: 188,
        จรัญสนิทวงศ์__7: 27,
        เพชรเกษม__5: 364,
        ราชสีมา: 206,
        พิษณุโลก__1: 169,
        สามเสน: 273,
        "ลาดพร้าว 71": 226,
        ลาดพร้าว__4: 221,
        "ลาดพร้าว 80": 227,
        ลาดพร้าว__5: 221,
        ลาดพร้าว__6: 221,
        "รามอินทรา 34": 212,
        รามอินทรา__2: 210,
        "รามอินทรา 14": 211,
        รามอินทรา__3: 210,
        บางขุนเทียนชายทะเล__1: 111,
        บางขุนเทียนชายทะเล__2: 111,
        ซอยนำชัย: 45,
        ประชาราษฎร์: 125,
        "ประชาราษฎร์สาย 2__5": 130,
        คู้บอน: 23,
        นิมิตใหม่__1: 104,
        หทัยราษฎร์__4: 311,
        หทัยมิตร__1: 309,
        "กำแพงเพชร 6__7": 15,
        แจ้งวัฒนะ__2: 397,
        นางลิ้นจี่__1: 101,
        จันทน์__3: 34,
        เย็นอากาศ: 377,
        เกษมราษฎร์__1: 340,
        สุนทรโกษา__2: 301,
        อาจณรงค์: 325,
        รัชดาภิเษก__10: 188,
        "พระรามที่ 3__3": 153,
        เศรษฐศิริ__1: 386,
        เทอดดำริ: 359,
        ประดิษฐ์มนูธรรม__2: 138,
        ลาดพร้าว__7: 221,
        ประดิษฐ์มนูธรรม__3: 138,
        จรัญสนิทวงศ์__8: 27,
        "จรัญสนิทวงศ์ 35": 31,
        จรัญสนิทวงศ์__9: 27,
        จรัญสนิทวงศ์__10: 27,
        ศาลาธรรมสพน์: 248,
        "พุทธมณฑลสาย 3": 173,
        อุทยาน: 332,
        พุทธบูชา__1: 170,
        พุทธบูชา__2: 170,
        "สุขสวัสดิ์ 26": 281,
        สมเด็จพระเจ้าตากสิน: 253,
        ประชาธิปก__1: 123,
        อินทรพิทักษ์: 327,
        ลาดหญ้า__2: 231,
        ลาดหญ้า__3: 231,
        ราชวิถี__4: 204,
        รางน้ำ: 192,
        พหลโยธิน__8: 161,
        ทางเข้าขนส่งเอกมัย: 80,
        "สุขุมวิท 63": 296,
        สุขุมวิท__11: 286,
        "เพชรเกษม 81__3": 370,
        เพชรเกษม__6: 364,
        "เพชรเกษม 81(มาเจริญ)": 371,
        หลานหลวง__3: 319,
        พิษณุโลก__2: 169,
        สวรรคโลก: 258,
        เพชรบุรี__5: 362,
        "เอราวัณ ปาร์ค อเวนิว__1": 396,
        เลียบทางรถไฟสายใต้__2: 383,
        รามคำแหง__3: 207,
        "รามคำแหง 24": 208,
        รามคำแหง__4: 207,
        "สุขุมวิท 71": 297,
        สุขุมวิท__12: 286,
        "พระรามที่ 4__5": 154,
        สุขุมวิท__13: 286,
        ดวงพิทักษ์: 52,
        ทางขึ้นลงทางด่วน: 76,
        เพลินจิต__1: 373,
        สุขุมวิท__14: 286,
        บรรทัดทอง__1: 106,
        เพชรบุรี__6: 362,
        จรัญสนิทวงศ์__11: 27,
        บางกอกน้อยตลิ่งชัน: 108,
        "จรัญสนิทวงศ์ 32__1": 30,
        นราธิวาสราชนครินทร์__2: 96,
        สาทร: 271,
        บางแค__1: 117,
        เพชรเกษม__7: 364,
        "เพชรเกษม 69__1": 369,
        เลียบคลองภาษีเจริญฝั่งใต้__3: 381,
        สวนจำปี: 256,
        พญาไท__2: 143,
        เพชรบุรี__7: 362,
        จรัญสนิทวงศ์__12: 27,
        สิรินธร: 278,
        ราชวิถี__5: 204,
        ประชาชื่น__7: 121,
        เทศบาลสงเคราะห์__1: 358,
        ประชาชื่น__8: 121,
        "ประชาชื่น 37": 122,
        "พัฒนาการ 25": 165,
        พัฒนาการ__2: 164,
        พัฒนาการ__3: 164,
        ถาวรธวัช: 70,
        รัชดาภิเษก__11: 188,
        อโศกดินแดง__1: 333,
        "พระราม 9": 147,
        สุขสวัสดิ์: 280,
        "พระรามที่ 2__2": 149,
        ประดิษฐ์มนูธรรม__4: 138,
        ประเสริฐมนูกิจ__1: 139,
        สามเสน__1: 273,
        ราชวิถี__6: 204,
        สามเสน__2: 273,
        สุโขทัย__1: 307,
        สามเสน__3: 273,
        ศรีอยุธยา__2: 247,
        สามเสน__4: 273,
        นครไชยศรี: 95,
        สามเสน__5: 273,
        เขียวไข่กา: 341,
        อำนวยสงคราม__1: 326,
        สามเสน__6: 273,
        ทหาร: 72,
        "ประชาราษฎร์สาย 1__2": 129,
        สามเสน__7: 273,
        กรุงเกษม__3: 1,
        สามเสน__8: 273,
        วิสุทธิกษัตริย์__2: 241,
        สามเสน__9: 273,
        พระสุเมรุ: 157,
        ราษฎร์บูรณะ: 214,
        "สุขสวัสดิ์ 35": 282,
        สุขสวัสดิ์__1: 280,
        คุ้มเกล้า__1: 19,
        คุ้มเกล้า__2: 19,
        สุวินทวงศ์__2: 303,
        ดินแดงตัดใหม่: 55,
        วิภาวดีรังสิต__1: 239,
        ดินแดง__3: 54,
        ดินสอ__3: 53,
        ราชดำเนิน: 195,
        พญาไท__3: 143,
        "พระรามที่ 1": 148,
        วุฒากาศ: 242,
        ซอยมะลิ: 46,
        เทอดไท__1: 360,
        "พุทธมณฑลสาย 3__1": 173,
        เพชรเกษม__8: 364,
        นวมินทร์__1: 98,
        "นวมินทร์ 51": 99,
        ศรีบูรพา__2: 246,
        สมเด็จพระเจ้าตากสิน__1: 253,
        ราชพฤกษ์: 201,
        กรุงธนบุรี__2: 0,
        "พระรามที่ 6__4": 156,
        ราชวิถี__7: 204,
        ร่มเกล้า: 216,
        รามคำแหง__5: 207,
        สุขุมวิท__15: 286,
        "สุขุมวิท 105": 289,
        มเหสักข์: 185,
        สีลม__2: 279,
        ประชาธิปไตย__3: 124,
        นครราชสีมา__2: 93,
        กรุงเกษม__4: 1,
        พหลโยธิน__9: 161,
        ประดิพัทธ์: 137,
        สุทธิสาร: 299,
        "พระรามที่ 5__3": 155,
        นครไชยศรี__1: 95,
        ราษฎร์อุทิศ__1: 215,
        สุวินทวงศ์__3: 304,
        เลียบวารี__8: 384,
        จรัญสนิทวงศ์__13: 27,
        บรมราชชนนี__1: 105,
        สมเด็จพระปิ่นเกล้า__2: 252,
        ราชดำริ__1: 194,
        "พระรามที่ 1__1": 148,
        เพลินจิต__2: 373,
        ราชดำริ__2: 194,
        ทางเข้าออกเซ็นทรัลเวิลดิ์: 89,
        ทางออกบิ๊กซี: 79,
        ราชดำริ__3: 194,
        "ทางเข้าบิ๊กซี และรร.อโนมา": 83,
        ราชดำริ__4: 194,
        ทางเข้าออกเกษรทาวเวอร์: 88,
        ราชดำริ__5: 194,
        ราชปรารภ__1: 200,
        เพชรบุรี__8: 362,
      },
    },
  ];

  const ClearData = () => {
    setRainfall("");
    setTemperature("");
    setRoadEncoded("");
    setDate("");
    setTotal_Vol_Calculated("");
    setTotal_Vol_Lag1("");
    setTotal_Vol_Lag7("");
    setPredictionResult(null);
  };

  const [open, setOpen] = React.useState(false);
  const handleSubmit = (e) => {
    e.preventDefault();
    console.log({
      rainfall,
      temperature,
      roadEncoded,
      date,
      Total_Vol_Calculated,
      Total_Vol_Lag1,
      Total_Vol_Lag7,
    });

    // ตรวจสอบว่าผู้ใช้กรอกข้อมูลครบถ้วนหรือไม่
    if (
      !rainfall ||
      !temperature ||
      !roadEncoded ||
      !date ||
      !Total_Vol_Calculated ||
      !Total_Vol_Lag1 ||
      !Total_Vol_Lag7
    ) {
      setOpenSnackbar(true);
      return;
    }
    setOpen(true);

    const dataForAPI = {
      Date: date,
      Road_Encoded: roadEncoded,
      Temperature: temperature,
      Rainfall: rainfall,
      Total_Vol_Calculated: Total_Vol_Calculated,
      Total_Vol_Lag1: Total_Vol_Lag1,
      Total_Vol_Lag7: Total_Vol_Lag7,
    };

    fetch("http://13.236.44.252:3000/api/traffic/bkk", {
      method: "POST",
      headers: {
        "Content-Type": "application/json",
      },
      body: JSON.stringify(dataForAPI),
    })
      .then((res) => {
        if (!res.ok) {
          throw new Error("Network response was not ok");
        }
        return res.json();
      })
      .then((data) => {
        setPredictionResult(data);
        setOpen(false);
      })
      .catch((error) => {
        setOpen(false);
        console.error("Error:", error);
      });

    ClearData();
  };

  return (
    <div>
      <Typography variant="body2" sx={{ marginBottom: 2 }}>
        โมเดลการทำนายจราจรในกรุงเทพมหานคร (Bangkok Traffic Prediction Model)
        โดยใช้ Support Vector Regression (SVR)
      </Typography>
      <form onSubmit={handleSubmit}>
        <Grid container spacing={2}>
          {/* Rainfall input */}
          <Grid item xs={12} sm={6}>
            <TextField
              label="ปริมาณน้ำฝน"
              type="number"
              fullWidth
              value={rainfall}
              onChange={(e) => setRainfall(e.target.value)}
              placeholder="15.5 (ปริมาณน้ำฝนในหน่วยมิลลิเมตร)"
            />
          </Grid>

          {/* Temperature input */}
          <Grid item xs={12} sm={6}>
            <TextField
              label="อุณหภูมิ"
              type="number"
              fullWidth
              value={temperature}
              onChange={(e) => setTemperature(e.target.value)}
              placeholder="24.5 (อุณหภูมิในหน่วยเซลเซียส)"
            />
          </Grid>

          <Grid item xs={12} sm={6}>
            <TextField
              label="คาดจำนวนรถ"
              type="number"
              fullWidth
              value={Total_Vol_Calculated}
              onChange={(e) => setTotal_Vol_Calculated(e.target.value)}
              placeholder="1500 (จำนวนรถที่คาดว่าจะเข้ามาในช่วงเวลานั้น)"
            />
          </Grid>

          <Grid item xs={12} sm={6}>
            <TextField
              label="จำนวนรถย้อนหลัง 1 วัน"
              type="number"
              fullWidth
              value={Total_Vol_Lag1}
              onChange={(e) => setTotal_Vol_Lag1(e.target.value)}
              placeholder="3500 คัน"
            />
          </Grid>

          <Grid item xs={12} sm={6}>
            <TextField
              label="จำนวนรถย้อนหลัง 7 วัน"
              type="number"
              fullWidth
              value={Total_Vol_Lag7}
              onChange={(e) => setTotal_Vol_Lag7(e.target.value)}
              placeholder="25000 คัน"
            />
          </Grid>

          {/* Road Encoded drop-down */}
          <Grid item xs={12} sm={6}>
            <FormControl fullWidth>
              <InputLabel>ถนน</InputLabel>
              <Select
                value={roadEncoded}
                onChange={(e) => setRoadEncoded(e.target.value)}
                label="ถนน"
              >
                <MenuItem value="">เลือกถนน</MenuItem>
                {Object.entries(Code[0]["รหัสถนน"] || {}).map(
                  ([roadName, roadCode]) => (
                    <MenuItem key={roadName} value={roadCode}>
                      {roadName}
                    </MenuItem>
                  )
                )}
              </Select>
            </FormControl>
          </Grid>

          {/* Date input */}
          <Grid item xs={12} sm={6}>
            <TextField
              label="Date"
              type="date"
              fullWidth
              value={date}
              onChange={(e) => setDate(e.target.value)}
              InputLabelProps={{
                shrink: true,
              }}
            />
          </Grid>

          {/* Submit Button */}
          <Grid item xs={12}>
            <Button
              variant="contained"
              type="submit"
              sx={12}
              style={{ backgroundColor: "#7cb342", color: "white" }}
            >
              ทำนายการจราจร
            </Button>
          </Grid>
        </Grid>
        <Snackbar
          open={openSnackbar}
          autoHideDuration={3000}
          onClose={handleClose}
          anchorOrigin={{ vertical: "top", horizontal: "right" }} // ย้ายไปขวาบน
          message={
            <Typography sx={{ color: "white" }}>
              ⚠ กรุณากรอกข้อมูลให้ครบถ้วน
            </Typography>
          }
          sx={{
            "& .MuiSnackbarContent-root": {
              backgroundColor: "#f44336",
              color: "white",
              fontSize: "16px",
            },
          }}
        />

        <Backdrop
          sx={{ color: "#fff", zIndex: (theme) => theme.zIndex.drawer + 1 }}
          open={open}
          handleClose={handleClose}
        >
          <CircularProgress color="inherit" />
        </Backdrop>
      </form>
      {predictionResult?.Total_Vol_Predicted !== undefined && (
        <div>
          <Typography variant="h5" sx={{ marginTop: 2, marginBottom: 2 }}>
            ผลการทำนาย
          </Typography>

          <Card variant="outlined" sx={{ maxWidth: 360 }}>
            <Box sx={{ p: 2 }}>
              <Typography variant="body2">
                ผลการทำนายจำนวนรถที่จะเข้ามาในช่วงเวลานั้น
              </Typography>

              <Typography variant="body1">
                ค่าคาดการณ์:{" "}
                <strong style={{ color: colors.red[600] }}>
                  {predictionResult.Traffic_Severity}
                </strong>{" "}
                <br />
                จำนวนรถที่คาดการณ์:{" "}
                <strong style={{ color: colors.green[700] }}>
                  {Math.round(predictionResult.Total_Vol_Predicted)} คัน
                </strong>{" "}
                <br />
              </Typography>
            </Box>
            <Divider />
          </Card>
        </div>
      )}
    </div>
  );
}

export default SVRContent;
